XML_Morozova_Olga.txt

Morozova_Olga

Поиск ошибок в тексте.

1. Запрос:
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:spel="http://speller.yandex.net/services/spellservice">
   <soap:Header/>
   <soap:Body>
      <spel:CheckTextsRequest lang="ru" options="4" format="plain">
         <spel:text>Я никогда не была твоей, мы вместе были в кругу друзей, ты провожал меня до дверей, я говорила "Привет, Андрей!" 
         И вот однажды я поняла, что без тебя словно не жила, когда ты даришь мне роз букет, я говорю-Привет!
         Привет Андрей!</spel:text>
      </spel:CheckTextsRequest>
   </soap:Body>
</soap:Envelope>

Ответ:
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
   <soap:Body>
      <CheckTextsResponse xmlns="http://speller.yandex.net/services/spellservice">
         <ArrayOfSpellResult>
            <SpellResult>
               <error code="1" pos="209" row="1" col="95" len="6">
                  <word>говорб</word>
                  <s>говорю</s>
               </error>
            </SpellResult>
         </ArrayOfSpellResult>
      </CheckTextsResponse>
   </soap:Body>
</soap:Envelope>

2. Запрос:
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:spel="http://speller.yandex.net/services/spellservice">
   <soap:Header/>
   <soap:Body>
      <spel:CheckTextsRequest lang="ru" options="6" format="plain">
         <!--Zero or more repetitions:-->
         <spel:text>Мнчта сбывается</spel:text>
      </spel:CheckTextsRequest>
   </soap:Body>
</soap:Envelope>

Ответ:
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
   <soap:Body>
      <CheckTextsResponse xmlns="http://speller.yandex.net/services/spellservice">
         <ArrayOfSpellResult>
            <SpellResult>
               <error code="1" pos="0" row="0" col="0" len="5">
                  <word>Мнчта</word>
                  <s>Мечта</s>
               </error>
            </SpellResult>
         </ArrayOfSpellResult>
      </CheckTextsResponse>
   </soap:Body>
</soap:Envelope>

3. Запрос:
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:spel="http://speller.yandex.net/services/spellservice">
   <soapenv:Header/>
   <soapenv:Body>
      <spel:CheckTextsRequest lang="ru" options="6" format="plain">
         <spel:text>Как прощел твой день</spel:text>
      </spel:CheckTextsRequest>
   </soapenv:Body>
</soapenv:Envelope>

Ответ:
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <CheckTextsResponse xmlns="http://speller.yandex.net/services/spellservice">
         <ArrayOfSpellResult>
            <SpellResult>
               <error code="1" pos="4" row="0" col="4" len="6">
                  <word>прощел</word>
                  <s>прошел</s>
               </error>
            </SpellResult>
         </ArrayOfSpellResult>
      </CheckTextsResponse>
   </soap:Body>
</soap:Envelope>

4. Запрос: 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:spel="http://speller.yandex.net/services/spellservice">
   <soapenv:Header/>
   <soapenv:Body>
      <spel:CheckTextsRequest lang="ru" options="6" format="plain">
         <spel:text>Мечты сбваются не только в Газпроме</spel:text>
      </spel:CheckTextsRequest>
   </soapenv:Body>
</soapenv:Envelope>

Ответ:
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <CheckTextsResponse xmlns="http://speller.yandex.net/services/spellservice">
         <ArrayOfSpellResult>
            <SpellResult>
               <error code="1" pos="6" row="0" col="6" len="8">
                  <word>сбваются</word>
                  <s>сбываются</s>
               </error>
            </SpellResult>
         </ArrayOfSpellResult>
      </CheckTextsResponse>
   </soap:Body>
</soap:Envelope>

5. Запрос:
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:spel="http://speller.yandex.net/services/spellservice">
   <soapenv:Header/>
   <soapenv:Body>
      <spel:CheckTextsRequest lang="ru" options="8" format="plain">
         <spel:text>Жили были старик со сторухой у самого самого синего моря</spel:text>
      </spel:CheckTextsRequest>
   </soapenv:Body>
</soapenv:Envelope>

Ответ:
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <CheckTextsResponse xmlns="http://speller.yandex.net/services/spellservice">
         <ArrayOfSpellResult>
            <SpellResult>
               <error code="1" pos="20" row="0" col="20" len="8">
                  <word>сторухой</word>
                  <s>старухой</s>
               </error>
               <error code="2" pos="38" row="0" col="38" len="6">
                  <word>самого</word>
               </error>
            </SpellResult>
         </ArrayOfSpellResult>
      </CheckTextsResponse>
   </soap:Body>
</soap:Envelope>